[
  {
    "id": 1,
    "question": "Good morning Le Minh Tuan. To start, please introduce yourself and tell me a bit about your background and what brings you here today.",
    "category": "opening",
    "purpose": "Allow the candidate to introduce themselves and set the stage for the interview."
  },
  {
    "id": 2,
    "question": "Every individual has unique strengths and areas for development. Could you share what you consider to be your greatest strengths, and an area you are actively working on to improve?",
    "category": "opening",
    "purpose": "Assess self-awareness, personal attributes, and commitment to self-development."
  },
  {
    "id": 3,
    "question": "You're a third-year student with experience in data engineering. What specifically attracts you to this Data Analyst position, and why do you believe it's the right fit for you at this stage of your career?",
    "category": "opening",
    "purpose": "Understand the candidate's motivation for the role and their understanding of the Data Analyst function."
  },
  {
    "id": 4,
    "question": "Your CV mentions you are comfortable working in team environments. Can you describe a specific situation from your internship or a project where you had to collaborate closely with others to achieve a common goal? What was your role, and what was the outcome?",
    "category": "behavioral",
    "purpose": "Assess teamwork, collaboration skills, ability to contribute in a group, and communication."
  },
  {
    "id": 5,
    "question": "You list 'self-learning' and being 'quick to learn new systems' as strengths, and you're currently learning Airtable. Can you tell me about a time you encountered a significant technical challenge or had to learn a completely new tool or concept quickly for a project or task? How did you approach it, and what did you learn from the experience?",
    "category": "behavioral",
    "purpose": "Evaluate adaptability, proactive learning, problem-solving approach, and resilience in new situations."
  },
  {
    "id": 6,
    "question": "In your Data Engineering Intern role, you mentioned creating data pipelines using SQL (Oracle) to collect, clean, and transform raw data. Can you elaborate on a common data cleaning challenge you encountered while working with raw data, and how you used SQL queries to resolve it effectively?",
    "category": "technical",
    "purpose": "Assess practical SQL skills, understanding of data cleaning techniques, and problem-solving within a database context suitable for a Fresher.",
    "focus": "SQL / Data Cleaning & Transformation"
  },
  {
    "id": 7,
    "question": "You've used Excel for data visualization in your 'Pizza Sales Data Visualization' project and Power BI is listed in your skills. As a Data Analyst, when would you choose to use a tool like Excel for presenting insights, versus a more dedicated business intelligence tool like Power BI? Could you give an example scenario for each?",
    "category": "technical",
    "purpose": "Evaluate understanding of different data visualization tools, their appropriate use cases, and awareness of audience/context in reporting.",
    "focus": "Data Visualization / Power BI / Excel"
  },
  {
    "id": 8,
    "question": "Your 'Travel Destination Research Tracker' project involved web scraping with Python to collect data. Beyond just scraping, how do you see Python being utilized by a Data Analyst for typical tasks such as further data cleaning, manipulation, or basic statistical analysis before the data is ingested into a database or used in a BI tool?",
    "category": "technical",
    "purpose": "Assess understanding of Python's utility in the data analysis workflow, general data manipulation concepts, and its role beyond initial data collection.",
    "focus": "Python / Data Manipulation"
  },
  {
    "id": 9,
    "question": "During your Data Engineering Intern role at FSS, you mentioned gaining foundational knowledge of financial and banking operations. How did understanding these specific industry operations help you in your tasks, such as creating data pipelines or supporting data extraction and reporting, particularly in making your outputs more relevant or accurate?",
    "category": "cv_based",
    "purpose": "Deep dive into the candidate's work experience, connect technical skills with business context, and assess understanding of data's impact on business outcomes."
  },
  {
    "id": 10,
    "question": "Let's discuss your 'Travel Destination Research Tracker' project. You mentioned importing and organizing data in Airtable using custom views and tags to help users compare and choose destinations. Could you elaborate on your thought process behind designing these custom views and tags? What specific user pain points were you trying to address, and how successful was your solution?",
    "category": "cv_based",
    "purpose": "Understand the candidate's problem-solving approach in a project, their user-centric design thinking, and their ability to articulate project outcomes."
  },
  {
    "id": 11,
    "question": "Imagine you're asked to analyze customer feedback data for a new travel package, but the data is collected from various sources – social media comments, survey free-text fields, and email responses. This data is largely unstructured and inconsistent. As a Fresher Data Analyst, how would you approach this problem to extract meaningful insights and present them in a structured way?",
    "category": "creative",
    "purpose": "Test problem-solving methodology, critical thinking, ability to handle unstructured data, and communication of an analytical approach."
  }
]